# Recitation 9 - SQL Exercise notebook

For the following exercises we will use the following libraries: <br>
- pandas (tabular data) https://pandas.pydata.org/docs/
- sqlite database engine https://www.sqlite.org/index.html <br>

In [5]:
import sqlite3
import pandas as pd

This code example is from w3schools website: [Link](https://www.w3schools.com/sql/default.asp)

# Database Scheme

In [6]:
conn = sqlite3.connect('w3school_database') 
c = conn.cursor()

In [7]:
c.execute('''
            CREATE TABLE IF NOT EXISTS Drones
            (
            DroneID INTEGER PRIMARY KEY,
            Manufacturer TEXT,
            Model TEXT,
            PayloadCapacity REAL,
            AlgoUses TEXT
            )
          ''');

In [8]:
c.execute('''
            CREATE TABLE IF NOT EXISTS Algorithms
            (
            AlgoName TEXT PRIMARY KEY,
            License TEXT,
            NeedInternet INTEGER,
            BasedGPS INTEGER
            )
          ''');

In [9]:
c.execute('''
            CREATE TABLE IF NOT EXISTS Products
            (
            ItemID INTEGER PRIMARY KEY,
            CatalogNumber INTEGER,
            Type TEXT,
            Price REAL,
            Weight REAL,
            Height REAL,
            FOREIGN KEY (CatalogNumber) REFERENCES Food(CatalogNumber),
            FOREIGN KEY (CatalogNumber) REFERENCES Flowers(CatalogNumber),
            FOREIGN KEY (CatalogNumber) REFERENCES Orders(CatalogNumber)
            )
          ''');

In [10]:
c.execute('''
            CREATE TABLE IF NOT EXISTS Customers
            (
            ID INTEGER PRIMARY KEY,
            FullName TEXT,
            Gender TEXT,
            Address TEXT,
            DateOfBirth TEXT,
            PartnerID INTEGER,
            GiftCardEligible INTEGER
            )
          ''');

In [11]:
c.execute('''
            CREATE TABLE IF NOT EXISTS Flowers 
            (
            CatalogNumber INTEGER PRIMARY KEY,
            Name TEXT,
            Color TEXT,
            LightNeed TEXT,
            WaterNeed TEXT
            )
          ''');

In [12]:
c.execute('''
            CREATE TABLE IF NOT EXISTS Flowers 
            (
            CatalogNumber INTEGER PRIMARY KEY,
            Name TEXT,
            Color TEXT,
            LightNeed TEXT,
            WaterNeed TEXT
            )
          ''');

In [13]:
c.execute('''
            CREATE TABLE IF NOT EXISTS Orders
            (
            CustomerID INTEGER,
            TimeDate TEXT,
            CatalogNumber INTEGER,
            DroneID INTEGER,
            Quantity INTEGER,
            TotalPrice REAL,
            PRIMARY KEY (CustomerID, TimeDate, CatalogNumber),
            FOREIGN KEY (CustomerID) REFERENCES Customers(ID),
            FOREIGN KEY (CatalogNumber) REFERENCES Products(CatalogNumber),
            FOREIGN KEY (DroneID) REFERENCES Drones(DroneID)
            )
          ''');

In [14]:
c.execute('''
            CREATE TABLE IF NOT EXISTS FlowersInventory
            (
            CatalogNumber INTEGER,
            Room TEXT,
            Shelf TEXT,
            Quantity INTEGER,
            PRIMARY KEY (CatalogNumber, Room, Shelf)
            )
          ''');

In [15]:
c.execute('''
            CREATE TABLE IF NOT EXISTS FoodBusiness
            (
            BusinessName TEXT,
            Address TEXT,
            Phone TEXT,
            PRIMARY KEY (BusinessName)
            )
          ''');

In [16]:
conn.commit()

# Insert data

In [17]:
conn = sqlite3.connect('w3school_database') 
c = conn.cursor()

In [18]:
c.execute('''
    INSERT INTO Drones (DroneID, Manufacturer, Model, PayloadCapacity, AlgoUses)
    VALUES
        (1, 'DJI', 'Mavic Air 2', 2.49, 'FreeNav'),
        (2, 'DJI', 'Phantom 4 Pro', 2.03, 'FreeNav'),
        (3, 'DJI', 'Mavic Air 2', 2.49, 'NavGar'),
        (4, 'DJI', 'Mavic Air 2', 2.49, 'FreeNav'),
        (5, 'DJI', 'Mavic Air 2', 2.49, 'NavGar'),
        (6, 'Parrot', 'Anafi', 0.31, 'FreeNav'),
        (7, 'Parrot', 'Anafi', 0.31, 'NavGar'),
        (8, 'Parrot', 'Anafi', 0.31, 'FreeNav'),
        (9, 'Parrot', 'Bebop 2', 0.5, 'NavGar'),
        (10, 'Parrot', 'Anafi', 0.31, 'NavGar')
''')

In [19]:
c.execute('''
    INSERT INTO Algorithms (AlgoName, License, NeedInternet, BasedGPS)
    VALUES
        ('FreeNav', 'Free', 1, 0),
        ('NavGar', 'GARMIN', 0, 1)

''')

In [20]:
# YOUR QUERY
c.execute('''

SELECT *
FROM Drones AS d 
JOIN Algorithms AS a ON
d.AlgoUses = a.AlgoName

          ''')

df = pd.DataFrame(c.fetchall())
df.head(50)

    0       1              2     3        4        5       6  7  8
0   1     DJI    Mavic Air 2  2.49  FreeNav  FreeNav    Free  1  0
1   2     DJI  Phantom 4 Pro  2.03  FreeNav  FreeNav    Free  1  0
2   3     DJI    Mavic Air 2  2.49   NavGar   NavGar  GARMIN  0  1
3   4     DJI    Mavic Air 2  2.49  FreeNav  FreeNav    Free  1  0
4   5     DJI    Mavic Air 2  2.49   NavGar   NavGar  GARMIN  0  1
5   6  Parrot          Anafi  0.31  FreeNav  FreeNav    Free  1  0
6   7  Parrot          Anafi  0.31   NavGar   NavGar  GARMIN  0  1
7   8  Parrot          Anafi  0.31  FreeNav  FreeNav    Free  1  0
8   9  Parrot        Bebop 2  0.50   NavGar   NavGar  GARMIN  0  1
9  10  Parrot          Anafi  0.31   NavGar   NavGar  GARMIN  0  1

In [ ]:
import random
import string

# Function to generate random full names
def generate_full_name():
    first_name = random.choice(["John", "Emma", "David", "Sophia", "Michael", "Olivia"])
    last_name = random.choice(["Smith", "Johnson", "Brown", "Taylor", "Miller", "Davis"])
    return f"{first_name} {last_name}"

# Function to generate random genders
def generate_gender():
    return random.choice(["Male", "Female"])

# Function to generate random addresses
def generate_address():
    street = random.choice(["Main Street", "Oak Avenue", "Park Road", "Cedar Lane", "Maple Street"])
    number = random.randint(1, 100)
    city = "Tel Aviv"
    return f"{number} {street}, {city}"

# Function to generate random partner IDs (only a subset)
def generate_partner_id():
    return random.choice([1, 2, 3, None])

# Function to generate random gift card eligibility
def generate_gift_card_eligibility():
    return random.choice([0, 1])

# Generate 100 customers and insert them into the table
for i in range(1, 101):
    full_name = generate_full_name()
    gender = generate_gender()
    address = generate_address()
    date_of_birth = ''.join(random.choice(string.digits) for _ in range(8))
    partner_id = generate_partner_id()
    gift_card_eligible = generate_gift_card_eligibility()

    c.execute('''
        INSERT INTO Customers (ID, FullName, Gender, Address, DateOfBirth, PartnerID, GiftCardEligible)
        VALUES (?, ?, ?, ?, ?, ?, ?)
    ''', (i, full_name, gender, address, date_of_birth, partner_id, gift_card_eligible))

# Commit the changes
conn.commit()

In [ ]:
# YOUR QUERY
c.execute('''

SELECT *
FROM Costumers

          ''')

df = pd.DataFrame(c.fetchall())
df.head(50)

In [ ]:
c.execute('''
          INSERT INTO employees (EmployeeID, LastName, FirstName, BirthDate, Photo, Notes)
                VALUES
                (1, 'Davolio', 'Nancy', '1968-12-08', 'EmpID1.pic', 'Education includes a BA in psychology from Colorado State University. She also completed (The Art of the Cold Call). Nancy is a member of Toastmasters International.'),
                (2, 'Fuller', 'Andrew', '1952-02-19', 'EmpID2.pic', 'Andrew received his BTS commercial and a Ph.D. in international marketing from the University of Dallas. He is fluent in French and Italian and reads German. He joined the company as a sales representative, was promoted to sales manager and was then named vice president of sales. Andrew is a member of the Sales Management Roundtable, the Seattle Chamber of Commerce, and the Pacific Rim Importers Association.'),
                (3, 'Leverling', 'Janet', '1963-08-30', 'EmpID3.pic', 'Janet has a BS degree in chemistry from Boston College). She has also completed a certificate program in food retailing management. Janet was hired as a sales associate and was promoted to sales representative.'),
                (4, 'Peacock', 'Margaret', '1958-09-19', 'EmpID4.pic', 'Margaret holds a BA in English literature from Concordia College and an MA from the American Institute of Culinary Arts. She was temporarily assigned to the London office before returning to her permanent post in Seattle.'),
                (5, 'Buchanan', 'Steven', '1955-03-04', 'EmpID5.pic', 'Steven Buchanan graduated from St. Andrews University, Scotland, with a BSC degree. Upon joining the company as a sales representative, he spent 6 months in an orientation program at the Seattle office and then returned to his permanent post in London, where he was promoted to sales manager. Mr. Buchanan has completed the courses Successful Telemarketing and International Sales Management. He is fluent in French.'),
                (6, 'Suyama', 'Michael', '1963-07-02', 'EmpID6.pic', 'Michael is a graduate of Sussex University (MA, economics) and the University of California at Los Angeles (MBA, marketing). He has also taken the courses Multi-Cultural Selling and Time Management for the Sales Professional. He is fluent in Japanese and can read and write French, Portuguese, and Spanish.'),
                (7, 'King', 'Robert', '1960-05-29', 'EmpID7.pic', 'Robert King served in the Peace Corps and traveled extensively before completing his degree in English at the University of Michigan and then joining the company. After completing a course entitled Selling in Europe, he was transferred to the London office.'),
                (8, 'Callahan', 'Laura', '1958-01-09', 'EmpID8.pic', 'Laura received a BA in psychology from the University of Washington. She has also completed a course in business French. She reads and writes French.'),
                (9, 'Dodsworth', 'Anne', '1969-07-02', 'EmpID9.pic', 'Anne has a BA degree in English from St. Lawrence College. She is fluent in French and German.'),
                (10, 'West', 'Adam', '1928-09-19', 'EmpID10.pic', 'An old chum.')
          ''');

In [ ]:
conn.commit()

In [ ]:
conn = sqlite3.connect('w3school_database') 
c = conn.cursor()

## Example

In [21]:
c.execute('''
            SELECT *
            FROM [Products]
            WHERE [Price] > 20

          ''')

df = pd.DataFrame(c.fetchall(), columns=['ProductID', 'ProductName', 'SupplierID', 'CategoryID', 'Unit', 'Price'])
df.head(10)

Empty DataFrame
Columns: [ProductID, ProductName, SupplierID, CategoryID, Unit, Price]
Index: []

In [ ]:
c.execute('''
            SELECT *
            FROM [Products]
            WHERE [Price] IN (10,15,20)

          ''')

df = pd.DataFrame(c.fetchall(), columns=['ProductID', 'ProductName', 'SupplierID', 'CategoryID', 'Unit', 'Price'])
df.head(50)

In [ ]:
c.execute('''
            SELECT *
            FROM [Products]
            WHERE [ProductName] IS NOT Null

          ''')

df = pd.DataFrame(c.fetchall(), columns=['ProductID', 'ProductName', 'SupplierID', 'CategoryID', 'Unit', 'Price'])
df.head()

# Exercise
**Write a query which returns the output below each question. <br>
Be careful not to run the output cell (the output will disapper).**

### Question 1:
Select ProductId and ProductName where product name contains "Alice":<br>
hint: use LIKE

In [ ]:
# YOUR QUERY
c.execute('''
SELECT ProductId, ProductName
FROM products
WHERE ProductName LIKE "%Alice%"




          ''')

df = pd.DataFrame(c.fetchall(), columns=['ProductID', 'ProductName'])
df.head()

In [ ]:
## REQUIRED OUTPUT

### Question 2:
Select ProductId and ProductName where product name starts with "CH" and contains 5 chars:

In [ ]:
# YOUR QUERY
c.execute('''

SELECT ProductId, ProductName
FROM products
WHERE ProductName LIKE "%CH___"

          ''')

df = pd.DataFrame(c.fetchall(), columns=['ProductID', 'ProductName'])
df.head()

In [ ]:
## REQUIRED OUTPUT

### Question 3:
Select product ids names and suppliers of products from category 3

In [ ]:
# YOUR QUERY
c.execute('''

SELECT ProductId, ProductName, SupplierName
FROM products p JOIN Suppliers s ON s.SupplierID=p.SupplierID
WHERE CategoryID=3

          ''')

df = pd.DataFrame(c.fetchall(), columns=['ProductID', 'ProductName','SupplierName'])
df.head(50)

In [ ]:
## REQUIRED OUTPUT

### Question 4:
Select for each product in Orders the total price of the product if total price  is larger than 100, sort result by ProductId asc and by total price desc

**Because we don't have unitprice in order_details, please use the value of productID as unitprice**

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall(), columns=['OrderID', 'ProductID', 'Quantity', 'Price'])
df.head(10)

In [ ]:
## REQUIRED OUTPUT

### Question 5:
Select maximum product price:<br>
hint: use aggregation

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall())
df.head()

In [ ]:
## REQUIRED OUTPUT

### Question 6:
Select number of product supplied by supplier 2:

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall())
df.head()

In [ ]:
## REQUIRED OUTPUT

### Question 7:
Select for each supplier its ID and number of products it supplies:

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall(), columns=['SupplierID', 'SuppliersProducts'])
df.head(10)

In [ ]:
## REQUIRED OUTPUT

### Question 8:
Select for each supplier its ID and max product price is provides for suppliers with supplier id less than 15:

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall(), columns=['SupplierID', 'SupplierCostlyProductPrice'])
df.head(10)

In [ ]:
## REQUIRED OUTPUT

### Question 9:
Select for each supplier its ID and number of products it supplies for suppliers who provides more than 3 products:

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall(), columns=['SupplierID', 'SuppliersProducts'])
df.head(10)

In [ ]:
## REQUIRED OUTPUT

### Question 10:
Find for each order its total cost:

**Because we don't have unitprice in order_detail, please use the value of productID as unitprice**

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall(), columns=['OrderID', 'Price'])
df.head(10)

In [ ]:
## REQUIRED OUTPUT

### Question 11:
Find product id and name of the best seller product:

In [ ]:
# YOUR QUERY
c.execute('''





          ''')

df = pd.DataFrame(c.fetchall(), columns=['ProductID', 'ProductName'])
df.head()

In [ ]:
## REQUIRED OUTPUT